arduino12/n76e003_platformio/lib/N76E003/Function_Define.h
#ifndef _FUNCTION_DEFINE_H_
#define _FUNCTION_DEFINE_H_

#include "N76E003.h"
#include "Common.h"
#include "SFR_Macro.h"

#define nop _nop_();

//16 --> 8 x 2
#define HIBYTE(v1)							((uint8_t)((v1)>>8))
#define LOBYTE(v1)							((uint8_t)((v1)&0xFF))
//8 x 2 --> 16
#define MAKEWORD(v1,v2)						((((uint16_t)(v1))<<8)+(uint16_t)(v2))
//8 x 4 --> 32
#define MAKELONG(v1,v2,v3,v4)				(uint32_t)((v1<<32)+(v2<<16)+(v3<<8)+v4)
//32 --> 16 x 2
#define YBYTE1(v1)							((uint16_t)((v1)>>16))
#define YBYTE0(v1)							((uint16_t)((v1)&0xFFFF))
//32 --> 8 x 4
#define TBYTE3(v1)							((uint8_t)((v1)>>24))
#define TBYTE2(v1)							((uint8_t)((v1)>>16))
#define TBYTE1(v1)							((uint8_t)((v1)>>8))
#define TBYTE0(v1)							((uint8_t)((v1)&0xFF))

#define SET_BIT0							0x01
#define SET_BIT1							0x02
#define SET_BIT2							0x04
#define SET_BIT3							0x08
#define SET_BIT4							0x10
#define SET_BIT5							0x20
#define SET_BIT6							0x40
#define SET_BIT7							0x80
#define SET_BIT8							0x0100
#define SET_BIT9							0x0200
#define SET_BIT10							0x0400
#define SET_BIT11							0x0800
#define SET_BIT12							0x1000
#define SET_BIT13							0x2000
#define SET_BIT14							0x4000
#define SET_BIT15							0x8000

#define CLR_BIT0							0xFE
#define CLR_BIT1							0xFD
#define CLR_BIT2							0xFB
#define CLR_BIT3							0xF7
#define CLR_BIT4							0xEF
#define CLR_BIT5							0xDF
#define CLR_BIT6							0xBF
#define CLR_BIT7							0x7F

#define CLR_BIT8 							0xFEFF
#define CLR_BIT9 							0xFDFF
#define CLR_BIT10							0xFBFF
#define CLR_BIT11							0xF7FF
#define CLR_BIT12							0xEFFF
#define CLR_BIT13							0xDFFF
#define CLR_BIT14							0xBFFF
#define CLR_BIT15							0x7FFF

#define FAIL								1
#define PASS								0

// GPIO Quasi mode  
#define P00_Quasi_Mode						P0M1&=~SET_BIT0;P0M2&=~SET_BIT0
#define P01_Quasi_Mode						P0M1&=~SET_BIT1;P0M2&=~SET_BIT1
#define P02_Quasi_Mode						P0M1&=~SET_BIT2;P0M2&=~SET_BIT2
#define P03_Quasi_Mode						P0M1&=~SET_BIT3;P0M2&=~SET_BIT3
#define P04_Quasi_Mode						P0M1&=~SET_BIT4;P0M2&=~SET_BIT4
#define P05_Quasi_Mode						P0M1&=~SET_BIT5;P0M2&=~SET_BIT5
#define P06_Quasi_Mode						P0M1&=~SET_BIT6;P0M2&=~SET_BIT6
#define P07_Quasi_Mode						P0M1&=~SET_BIT7;P0M2&=~SET_BIT7
#define P10_Quasi_Mode						P1M1&=~SET_BIT0;P1M2&=~SET_BIT0
#define P11_Quasi_Mode						P1M1&=~SET_BIT1;P1M2&=~SET_BIT1
#define P12_Quasi_Mode						P1M1&=~SET_BIT2;P1M2&=~SET_BIT2
#define P13_Quasi_Mode						P1M1&=~SET_BIT3;P1M2&=~SET_BIT3
#define P14_Quasi_Mode						P1M1&=~SET_BIT4;P1M2&=~SET_BIT4
#define P15_Quasi_Mode						P1M1&=~SET_BIT5;P1M2&=~SET_BIT5
#define P16_Quasi_Mode						P1M1&=~SET_BIT6;P1M2&=~SET_BIT6
#define P17_Quasi_Mode						P1M1&=~SET_BIT7;P1M2&=~SET_BIT7
#define P30_Quasi_Mode						P3M1&=~SET_BIT0;P3M2&=~SET_BIT0

// GPIO Push Pull mode 
#define P00_PushPull_Mode					P0M1&=~SET_BIT0;P0M2|=SET_BIT0
#define P01_PushPull_Mode					P0M1&=~SET_BIT1;P0M2|=SET_BIT1
#define P02_PushPull_Mode					P0M1&=~SET_BIT2;P0M2|=SET_BIT2
#define P03_PushPull_Mode					P0M1&=~SET_BIT3;P0M2|=SET_BIT3
#define P04_PushPull_Mode					P0M1&=~SET_BIT4;P0M2|=SET_BIT4
#define P05_PushPull_Mode					P0M1&=~SET_BIT5;P0M2|=SET_BIT5
#define P06_PushPull_Mode					P0M1&=~SET_BIT6;P0M2|=SET_BIT6
#define P07_PushPull_Mode					P0M1&=~SET_BIT7;P0M2|=SET_BIT7
#define P10_PushPull_Mode					P1M1&=~SET_BIT0;P1M2|=SET_BIT0
#define P11_PushPull_Mode					P1M1&=~SET_BIT1;P1M2|=SET_BIT1
#define P12_PushPull_Mode					P1M1&=~SET_BIT2;P1M2|=SET_BIT2
#define P13_PushPull_Mode					P1M1&=~SET_BIT3;P1M2|=SET_BIT3
#define P14_PushPull_Mode					P1M1&=~SET_BIT4;P1M2|=SET_BIT4
#define P15_PushPull_Mode					P1M1&=~SET_BIT5;P1M2|=SET_BIT5
#define P16_PushPull_Mode					P1M1&=~SET_BIT6;P1M2|=SET_BIT6
#define P17_PushPull_Mode					P1M1&=~SET_BIT7;P1M2|=SET_BIT7
#define P30_PushPull_Mode					P3M1&=~SET_BIT0;P3M2|=SET_BIT0

// GPIO Input Only mode 
#define P00_Input_Mode						P0M1|=SET_BIT0;P0M2&=~SET_BIT0
#define P01_Input_Mode						P0M1|=SET_BIT1;P0M2&=~SET_BIT1
#define P02_Input_Mode						P0M1|=SET_BIT2;P0M2&=~SET_BIT2
#define P03_Input_Mode						P0M1|=SET_BIT3;P0M2&=~SET_BIT3
#define P04_Input_Mode						P0M1|=SET_BIT4;P0M2&=~SET_BIT4
#define P05_Input_Mode						P0M1|=SET_BIT5;P0M2&=~SET_BIT5
#define P06_Input_Mode						P0M1|=SET_BIT6;P0M2&=~SET_BIT6
#define P07_Input_Mode						P0M1|=SET_BIT7;P0M2&=~SET_BIT7
#define P10_Input_Mode						P1M1|=SET_BIT0;P1M2&=~SET_BIT0
#define P11_Input_Mode						P1M1|=SET_BIT1;P1M2&=~SET_BIT1
#define P12_Input_Mode						P1M1|=SET_BIT2;P1M2&=~SET_BIT2
#define P13_Input_Mode						P1M1|=SET_BIT3;P1M2&=~SET_BIT3
#define P14_Input_Mode						P1M1|=SET_BIT4;P1M2&=~SET_BIT4
#define P15_Input_Mode						P1M1|=SET_BIT5;P1M2&=~SET_BIT5
#define P16_Input_Mode						P1M1|=SET_BIT6;P1M2&=~SET_BIT6
#define P17_Input_Mode						P1M1|=SET_BIT7;P1M2&=~SET_BIT7
#define P30_Input_Mode						P3M1|=SET_BIT0;P3M2&=~SET_BIT0

// GPIO as Open Drain mode 
#define P00_OpenDrain_Mode					P0M1|=SET_BIT0;P0M2|=SET_BIT0
#define P01_OpenDrain_Mode					P0M1|=SET_BIT1;P0M2|=SET_BIT1
#define P02_OpenDrain_Mode					P0M1|=SET_BIT2;P0M2|=SET_BIT2
#define P03_OpenDrain_Mode					P0M1|=SET_BIT3;P0M2|=SET_BIT3
#define P04_OpenDrain_Mode					P0M1|=SET_BIT4;P0M2|=SET_BIT4
#define P05_OpenDrain_Mode					P0M1|=SET_BIT5;P0M2|=SET_BIT5
#define P06_OpenDrain_Mode					P0M1|=SET_BIT6;P0M2|=SET_BIT6
#define P07_OpenDrain_Mode					P0M1|=SET_BIT7;P0M2|=SET_BIT7
#define P10_OpenDrain_Mode					P1M1|=SET_BIT0;P1M2|=SET_BIT0
#define P11_OpenDrain_Mode					P1M1|=SET_BIT1;P1M2|=SET_BIT1
#define P12_OpenDrain_Mode					P1M1|=SET_BIT2;P1M2|=SET_BIT2
#define P13_OpenDrain_Mode					P1M1|=SET_BIT3;P1M2|=SET_BIT3
#define P14_OpenDrain_Mode					P1M1|=SET_BIT4;P1M2|=SET_BIT4
#define P15_OpenDrain_Mode					P1M1|=SET_BIT5;P1M2|=SET_BIT5
#define P16_OpenDrain_Mode					P1M1|=SET_BIT6;P1M2|=SET_BIT6
#define P17_OpenDrain_Mode					P1M1|=SET_BIT7;P1M2|=SET_BIT7
#define P30_OpenDrain_Mode					P3M1|=SET_BIT0;P3M2|=SET_BIT0

// GPIO all quasi mode 
#define Set_All_GPIO_Quasi_Mode				P0M1=0;P0M2=0;P1M1=0;P1M2=0;P3M1=0;P3M2=0

